[
    {
        "name": "About-me",
        "title": "About me",
        "description": [
            "Bonjour, je m'appelle Maxence, je suis développeur web.",
            "Avant de devenir passionnée de développement web, je travaillais dans le domaine de la recherche en biologie. J'ai suivi une formation de développement web avec OpenClassrooms.",
            "Au cours de cette formation j’ai créé une application front-end en React, et une API REST avec Node.js.",
            "J'ai également travaillé sur un site de e-commerce en JavaScript vanilla, en gérant et manipulant le local storage et le panier d'achat.",
            "Tous les sites sur lesquels j'ai travaillé sont responsives et s'adaptent aussi bien sur les smartphones que sur tablettes ou ordinateurs.",
            "Les technologies de développement web m'intéressent particulièrement, ainsi je continue d'apprendre et de me former.",
            "Je suis actuellement à la recherche d'un emploi dans le développement web en tant que Junior afin d'approfondir mes compétences mais aussi de partager mes connaissances.",
            "Au fil des mes expériences professionnelles, j'ai apprécié travailler en équipe, même si je suis autonome dans mon travail. Je suis désormais prête à relever de nouveaux challenges."
        ]
    },
    {
        "name": "CV",
        "title": "CV"
    },
    {
        "name": "Contact",
        "title": "Contact"
    },
    {
        "name": "Projects",
        "title": "Projects"
    },
    {
        "name": "OpenClassrooms",
        "title": "OpenClassrooms",
        "subDirectories": [
            {
                "name": "Booki",
                "title":"Booki",
                "ghPages": true,
                "description": [
                    "Booki, site de réservation et d’hébergement, est le premier projet OpenClassrooms.",
                    "L’objectif était d’apprendre à intégrer une maquette avec HTML et CSS et de réaliser une interface responsive."
                ]
            },
            {
                "name": "Ohmyfood",
                "title": "Ohmyfood",
                "ghPages": true,
                "description": [
                    "Ohmyfood, site 100% mobile qui répertorie les menus de restaurants gastronomiques, est le second projet OpenClassrooms.",
                    "L’objectif était d’apprendre à mettre en place des animations CSS modernes avec Sass, utiliser les keyframes et la propriété transform, et mettre en place un loading spinner."
                ]
            },
            {
                "name": "La-Panthere",
                "title": "La Panthère",
                "ghPages": true,
                "description": [
                    "La Panthère, agence de web design, est le troisième projet OpenClassrooms.",
                    "L’objectif était d’apprendre à optimiser la SEO et l’accessibilité sur un site web existant. Optimisation des performances et du référencement. Acquisition des bonnes pratiques du développement web."
                ]
            },
            {
                "name": "Kanap",
                "title": "Kanap",
                "ghPages": false,
                "description": [""]
            },
            {
                "name": "HotTakes",
                "title": "HotTakes",
                "ghPages": false,
                "description": [""]
            },
            {
                "name": "Kasa",
                "title": "Kasa",
                "ghPages": true,
                "description": [""]
            }
        ]
    },
    {
        "name": "Perso",
        "title": "Perso",
        "subDirectories": [
            {
                "name": "Portfolio",
                "title": "Portfolio",
                "ghPages": true,
                "description": [""]
            },
            {
                "name": "Rezo",
                "title": "Rezo",
                "ghPages": false,
                "description": [""]
            },
            {
                "name": "Calculator",
                "title": "Calculator",
                "ghPages": true,
                "description": [""]
            },
            {
                "name": "Animations-CSS",
                "title": "Animations CSS",
                "ghPages": true,
                "description": [""]
            }
        ]
    }
]